In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
db = sql.connect('database.sqlite')

In [3]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [34]:
run_query('SELECT MAX(duration),* FROM trip')

,MAX(duration),id,duration,start_date,start_station_name,start_station_id,end_date,end_station_name,end_station_id,bike_id,subscription_type,zip_code
0,17270400,568474,17270400,12/6/2014 21:59,South Van Ness at Market,66,6/24/2015 20:18,2nd at Folsom,62,535,Customer,95531

In [11]:
run_query('SELECT * FROM station WHERE name = "2nd at South Park"')

,id,name,lat,long,dock_count,city,installation_date
0,64,2nd at South Park,37.782259,-122.392738,15,San Francisco,8/22/2013

In [16]:
run_query('SELECT count(*) FROM trip WHERE end_station_id = (SELECT id FROM station WHERE name = "2nd at South Park") limit 5')

   count(*)
0     16843

In [36]:
run_query('SELECT count(*) FROM trip WHERE duration >= 1000 and duration <= 2000')

   count(*)
0     56909

In [23]:
run_query('SELECT bike_id,count(*) as all_trips FROM trip group by bike_id order by all_trips DESC LIMIT 5')

   bike_id  all_trips
0      392       2061
1      489       1975
2      558       1955
3      267       1951
4      631       1948

In [30]:

run_query('SELECT start_station_name,count(id) AS all_trips FROM trip where start_station_id == end_station_id group by start_station_name order by all_trips DESC limit 5')

                     start_station_name  all_trips
0                Embarcadero at Sansome       2092
1  Harry Bridges Plaza (Ferry Building)       1733
2                University and Emerson        894
3                         Market at 4th        724
4                       2nd at Townsend        683